000_РОЗНИЦА_ЦЕНТР/src/InformationRegisters/ЦеныНоменклатуры/ЦеныНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЦеныНоменклатуры</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Цена</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Упаковка</name>
    <type>
      <types>CatalogRef.УпаковкиНоменклатуры</types>
    </type>
  </resources>
  <resources>
    <name>Валюта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Акция</name>
    <comment>Признак акционной цены</comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ТипПереоценки</name>
    <type>
      <types>EnumRef.ТипыПереоценок</types>
    </type>
  </resources>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <dimensions>
    <name>ВидЦены</name>
    <type>
      <types>CatalogRef.ВидыЦен</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

000_РОЗНИЦА_ЦЕНТР/src/InformationRegisters/ЦеныНоменклатуры/Forms/ФормаСписка/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

//	Пропускаем инициализацию, чтобы гарантировать получение формы при передаче параметра "АвтоТест".
	Если Параметры.Свойство("АвтоТест") Тогда

		Возврат;

	КонецЕсли;

	Элементы.ЗаписатьВыделенныеСтроки.Доступность = ТехническаяПоддержкаВызовСервера.ИсключительныйРежим();

КонецПроцедуры

&НаСервере	//	LNK 05.11.2019 10:29:16
Процедура ЗаписатьТекущийНаборЗаписейНаСервере(Регистратор)

	НаборЗаписей = РегистрыСведений.ЦеныНоменклатуры.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Регистратор.Установить(Регистратор);
	НаборЗаписей.Прочитать();
	НаборЗаписей.Записать();

	Для каждого СтрокаНабора Из НаборЗаписей Цикл

		ПланыОбмена.ЗарегистрироватьИзменения(ОбменДаннымиПовтИсп.ПолучитьМассивУзловПланаОбмена("ПоМагазину"), СтрокаНабора.Номенклатура);

	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьТекущийНаборЗаписей(Команда)

	ЗаписатьТекущийНаборЗаписейНаСервере(Элементы.Список.ТекущиеДанные.Регистратор);

КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)

	ТекущиеДанные = Элемент.ТекущиеДанные;

	Если ВРег(Лев(СокрЛП(ТекущиеДанные.Регистратор), 18)) = "<ОБЪЕКТ НЕ НАЙДЕН>" Тогда

		СтандартнаяОбработка = Ложь;

		ПараметрыОткрытия = Новый Структура;
		ПараметрыОткрытия.Вставить("Период", ТекущиеДанные.Период);
		ПараметрыОткрытия.Вставить("Регистратор", ТекущиеДанные.Регистратор);
		ПараметрыОткрытия.Вставить("ВидЦены", ТекущиеДанные.ВидЦены);
		ПараметрыОткрытия.Вставить("Номенклатура", ТекущиеДанные.Номенклатура);
		ПараметрыОткрытия.Вставить("Цена", ТекущиеДанные.Цена);
		ПараметрыОткрытия.Вставить("Упаковка", ТекущиеДанные.Упаковка);
		ПараметрыОткрытия.Вставить("Акция", ТекущиеДанные.Акция);
		ПараметрыОткрытия.Вставить("ТипПереоценки", ТекущиеДанные.ТипПереоценки);

		ОткрытьФорму("РегистрСведений.ЦеныНоменклатуры.Форма.ФормаКлючаЗаписи", ПараметрыОткрытия, ЭтотОбъект, ЭтотОбъект,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

	КонецЕсли;

КонецПроцедуры
